import * as Yup from "yup";

export const validationSchema = Yup.object().shape({
  firstName: Yup.string()
    .required("Обов'язкове поле для заповнення!")
    .min(3, "Занадто коротке ім'я")
    .max(20, "Занадто довге ім'я")
    .matches(
      /^[А-ЯҐЄІЇа-яґєії'ʼ\s-]+$/,
      "Імʼя має містити тільки українські літери",
    ),
  lastName: Yup.string()
    .required("Обов'язкове поле для заповнення!")
    .min(3, "Занадто коротке прізвище")
    .max(30, "Занадто довге прізвище")
    .matches(
      /^[А-ЯҐЄІЇа-яґєії'ʼ\s-]+$/,
      "Прізвище має містити тільки українські літери",
    ),
  age: Yup.number()
    .required("Обов'язкове поле для заповнення!")
    .min(18, "Вік має бути не менше 18 років")
    .max(100, "Вік має бути не більше 100 років"),
  address: Yup.string()
    .required("Обов'язкове поле для заповнення!")
    .min(5, "Занадто коротка адреса")
    .max(100, "Занадто довга адреса")
    .matches(
      /^[А-ЯҐЄІЇа-яґєії'ʼ\s-\d]+$/,
      "Адреса має містити тільки українські літери",
    ),
  phone: Yup.string()
    .required("Обов'язкове поле для заповнення!")
    .matches(
      /^(\+?380|0)\d{9}$/,
      "Номер має починатися з +380, 380 або 0 та містити 9 цифр",
    ),
});
